fix assignment 4
